ngocthanhtnt/ledshow/ ledshow --username hzy1981/STM32/Usr/app/LED_Para.c
#define LED_PARA_C
#include "Includes.h"

#if QT_EN && QT_SIM_EN
extern S_Show_Data protoShowData;
#endif

//返回屏幕支持的颜色数
INT8U Get_Screen_Color_Num(void)
{
 
  if(Screen_Para.Base_Para.Color < 3 || Screen_Para.Base_Para.Color EQ 4)
      return 1;
  else if(Screen_Para.Base_Para.Color EQ 3 || Screen_Para.Base_Para.Color EQ 5 || Screen_Para.Base_Para.Color EQ 6)
      return 2;
  else if(Screen_Para.Base_Para.Color EQ 7)
      return 3;
  else
      return 0;

#if 0
    if(Screen_Para.Base_Para.Color < 3)// || Screen_Para.Base_Para.Color EQ 4)
        return 1;
    else if(Screen_Para.Base_Para.Color EQ 3)// || Screen_Para.Base_Para.Color EQ 5 || Screen_Para.Base_Para.Color EQ 6)
        return 2;
    else
        return 0;
#endif    
}

//获取不同显示参数的长度
INT8U Get_Show_Para_Len(INT8U Type)
{
  if(Type EQ SHOW_PIC)
    return sizeof(S_Pic_Para) - CHK_BYTE_LEN;
  else if(Type EQ SHOW_CLOCK)
    return sizeof(S_Clock_Para) - CHK_BYTE_LEN;
  else if(Type EQ SHOW_TIME)
    return sizeof(S_Time_Para) - CHK_BYTE_LEN;
  else if(Type EQ SHOW_TIMER)
    return sizeof(S_Timer_Para) - CHK_BYTE_LEN;
  else if(Type EQ SHOW_TEMP)
    return sizeof(S_Temp_Para) - CHK_BYTE_LEN;
  else if(Type EQ SHOW_LUN)
    return sizeof(S_Lun_Para) - CHK_BYTE_LEN;
  else if(Type EQ SHOW_HUMIDITY)
    return sizeof(S_Humidity_Para) - CHK_BYTE_LEN;
  else if(Type EQ SHOW_NOISE)
    return sizeof(S_Noise_Para) - CHK_BYTE_LEN;
  else
  {
    ASSERT_FAILED();
    return 0;
  }
  
}


void Set_File_Para_HT_Sum(U_File_Para *pPara)
{
    switch(pPara->Pic_Para.Flag)
    {
#if PIC_SHOW_EN      
    case SHOW_PIC:
     SET_HT((*pPara).Pic_Para);
     SET_SUM((*pPara).Pic_Para);
     break;
#endif
#if CLOCK_SHOW_EN     
    case SHOW_CLOCK:
     SET_HT((*pPara).Clock_Para);
     SET_SUM((*pPara).Clock_Para);
     break;
#endif
#if TIME_SHOW_EN     
    case SHOW_TIME:
     SET_HT((*pPara).Time_Para);
     SET_SUM((*pPara).Time_Para);
     break;
#endif
#if TIMER_SHOW_EN     
    case SHOW_TIMER:
     SET_HT((*pPara).Timer_Para);
     SET_SUM((*pPara).Timer_Para);
     break;
#endif
#if TEMP_SHOW_EN     
    case SHOW_TEMP:
     SET_HT((*pPara).Temp_Para);
     SET_SUM((*pPara).Temp_Para);
     break;
#endif
#if LUN_SHOW_EN     
    case SHOW_LUN:
     SET_HT((*pPara).Lun_Para);
     SET_SUM((*pPara).Lun_Para);
     break;
#endif
#if HUMIDITY_SHOW_EN     
    case SHOW_HUMIDITY:
     SET_HT((*pPara).Humidity_Para);
     SET_SUM((*pPara).Humidity_Para);
     break;
#endif
#if NOISE_SHOW_EN     
    case SHOW_NOISE:
     SET_HT((*pPara).Noise_Para);
     SET_SUM((*pPara).Noise_Para);
     break;
#endif
#if PIC_SHOW_EN     
    case SHOW_NULL:
     SET_HT((*pPara).Pic_Para);
     SET_SUM((*pPara).Pic_Para);
     break;
#endif     
    default:
     ASSERT_FAILED();
     break;
    }

}

INT8U Chk_File_Para_HT_Sum(U_File_Para *pPara)
{
    INT8U Re = 1;

    switch(pPara->Pic_Para.Flag)
    {
#if PIC_SHOW_EN
    case SHOW_PIC:
     Re &= CHK_HT((*pPara).Pic_Para);
     Re &= CHK_SUM((*pPara).Pic_Para);
     break;
#endif
#if CLOCK_SHOW_EN
    case SHOW_CLOCK:
     Re &= CHK_HT((*pPara).Clock_Para);
     Re &= CHK_SUM((*pPara).Clock_Para);
     break;
#endif
#if TIME_SHOW_EN
    case SHOW_TIME:
     Re &= CHK_HT((*pPara).Time_Para);
     Re &= CHK_SUM((*pPara).Time_Para);
     break;
#endif
#if TIMER_SHOW_EN
    case SHOW_TIMER:
     Re &= CHK_HT((*pPara).Timer_Para);
     Re &= CHK_SUM((*pPara).Timer_Para);
     break;
#endif
#if TEMP_SHOW_EN
    case SHOW_TEMP:
     Re &= CHK_HT((*pPara).Temp_Para);
     Re &= CHK_SUM((*pPara).Temp_Para);
     break;
#endif
#if LUN_SHOW_EN
    case SHOW_LUN:
     Re &= CHK_HT((*pPara).Lun_Para);
     Re &= CHK_SUM((*pPara).Lun_Para);
     break;
#endif
#if HUMIDITY_SHOW_EN
    case SHOW_HUMIDITY:
     Re &= CHK_HT((*pPara).Humidity_Para);
     Re &= CHK_SUM((*pPara).Humidity_Para);
     break;
#endif
#if NOISE_SHOW_EN
    case SHOW_NOISE:
     Re &= CHK_HT((*pPara).Noise_Para);
     Re &= CHK_SUM((*pPara).Noise_Para);
     break;
#endif
#if PIC_SHOW_EN
    case SHOW_NULL:
     Re &= CHK_HT((*pPara).Pic_Para);
     Re &= CHK_SUM((*pPara).Pic_Para);
     break;
#endif
    default:
     ASSERT_FAILED();
     Re = 0;
     break;
    }

    return Re;
}


//保存参数帧处理
INT8U _Write_Screen_Para(INT8U *pSrc, INT16U SrcLen)
{
  //INT8U Prog_No = Prog_Para.Prog_No;
  Write_Storage_Data(SDI_SCREEN_PARA , pSrc, SrcLen);
  
#ifdef SDI_SCREEN_PARA_BK0 
  Write_Storage_Data(SDI_SCREEN_PARA_BK0, pSrc, SrcLen);
#endif

#ifdef SDI_SCREEN_PARA_BK1 
  Write_Storage_Data(SDI_SCREEN_PARA_BK1, pSrc, SrcLen);
#endif  
  
  
#ifdef SDI_SCREEN_PARA_BK2 
  Write_Storage_Data(SDI_SCREEN_PARA_BK2, pSrc, SrcLen);
#endif 
  
  return 1;
}

//写屏幕参数
INT8U Write_Screen_Para(void)
{
  return _Write_Screen_Para(&Screen_Para.Head + 1, SCREEN_PARA_LEN);
}

INT16U _Read_Screen_Para(INT8U *pDst, INT8U *pDst_Start, INT16U DstLen)
{
    INT16U Len;

    Len = Read_Storage_Data(SDI_SCREEN_PARA,  pDst, pDst_Start, DstLen);
  #ifdef SDI_SCREEN_PARA_BK0
    if(Len EQ 0)
      Len = Read_Storage_Data(SDI_SCREEN_PARA_BK0,  pDst, pDst_Start, DstLen);
  #endif

  #ifdef SDI_SCREEN_PARA_BK1
    if(Len EQ 0)
      Len = Read_Storage_Data(SDI_SCREEN_PARA_BK1,  pDst, pDst_Start, DstLen);
  #endif

    if(Len EQ 0)
    {
        Len = Get_Storage_Data_Len(SDI_SCREEN_PARA);
        mem_set(pDst, 0, Len, pDst_Start, DstLen);
    }

    return Len;
}

//读取屏幕参数
INT16U Read_Screen_Para(void)
{
    INT8U Re;

    Re = _Read_Screen_Para(&Screen_Para.Head + 1, &Screen_Para.Head, sizeof(Screen_Para));
	if(Re > 0)
	{
	  SET_HT(Screen_Para);
	  SET_SUM(Screen_Para);
	}
	return Re;
}

//保存节目属性帧
INT8U Write_Prog_Para(INT8U Prog_No, INT8U *pSrc,INT16U SrcLen)
{

  Write_Storage_Data(SDI_PROG_PARA + Prog_No , pSrc, SrcLen);
  
#ifdef SDI_PROG_PARA_BK0 
  Write_Storage_Data(SDI_PROG_PARA_BK0 + Prog_No, pSrc, SrcLen);
#endif

#ifdef SDI_PROG_PARA_BK1 
  Write_Storage_Data(SDI_PROG_PARA_BK1 + Prog_No, pSrc, SrcLen);
#endif  
    
#ifdef SDI_PROG_PARA_BK2 
  Write_Storage_Data(SDI_PROG_PARA_BK2 + Prog_No, pSrc, SrcLen);
#endif

  //读出这个节目的存储索引
  //Prog_Status.Play_Status.Prog_No = Prog_No;
  //Read_Prog_Block_Index(Prog_No);
  return 1;
}

